{
  "easy composites": {
    "https://www.easycomposites.co.uk/pure-acetone": {
      "name": "Pure Acetone",
      "brand": "Easy Composites",
      "price": 3.0,
      "currency": "GBP",
      "description": "Acetone is a high strength solvent widely used in the composites industry for cleaning resin from brushes, rollers and equipment. Acetone will effectively dissolve and clean epoxy, polyester and vinylester resin. It can also be used as a high strength de-greaser/surface preparation and paint remover. Safety Information Acetone is a powerful and highly flammable solvent. Please observe the health and safety data.",
      "source_url": "https://www.easycomposites.co.uk/pure-acetone",
      "match_score": 1.0,
      "Purity": "100%"
    }
  },
  "saniclean": {
    "https://www.ebay.at/itm/184004463325": {
      "name": "Pure Acetone 99.8% Pure Multi Listing Pure Chem (White)",
      "brand": "Saniclean",
      "price": 8.89,
      "currency": "EUR",
      "description": "Pure Acetone 99.8% Pure Multi Listing Pure Chem (White). New, unused and undamaged item in unopened original packaging (where packaging is applicable). The packaging should be the same as what is found in a retail environment, unless the item was packaged by the manufacturer in non-retail packaging, such as an unprinted box or plastic bag. See the seller's listing for full details.",
      "image_url": [
        "https://i.ebayimg.com/images/g/RNgAAOSwhl9g5F5d/s-l1600.jpg",
        "https://i.ebayimg.com/images/g/61MAAOSwPzdg5FoX/s-l1600.png",
        "https://i.ebayimg.com/images/g/mvwAAOSwh1Vg5F5k/s-l1600.jpg",
        "https://i.ebayimg.com/images/g/pOAAAOSwTExg5Fog/s-l1600.png",
        "https://i.ebayimg.com/images/g/PlYAAOSwK~Ng5F5Z/s-l1600.jpg"
      ],
      "source_url": "https://www.ebay.at/itm/184004463325",
      "match_score": 0.9,
      "Purity": "99.8%",
      "Color": "White",
      "MPN": "SCEBACETONE",
      "Country/Region of Manufacture": "United Kingdom"
    }
  },
  "meru chem pvt. ltd.": {
    "https://www.meruchem.com/acetone-solvent-6852290.html": {
      "name": "Acetone Solvent",
      "brand": "MERU CHEM PVT. LTD.",
      "price": 90.0,
      "currency": "INR",
      "description": "Acetone SolventProduct Details:Purity %> 99%CAS Number67-64-1, 67-64-1Usage/ApplicationNail Polish RemoverPackaging Details5 Litre GallonGrade StandardIndustrial GradeFormLiquidSynonyms2-propanone,Propanone,Dimethyl ketoneChemical FormulaC3H6OSpecifications :ParameterUnitValuePurity% WT99.5 MinColorHazen U.10.0 MaxWater% WT0.4 Max",
      "source_url": "https://www.meruchem.com/acetone-solvent-6852290.html",
      "match_score": 0.8,
      "Purity": "99.5 Min",
      "Color": "Hazen U. 10.0 Max",
      "Water": "0.4 Max"
    }
  },
  "advanced paints": {
    "https://www.advancedpaints.co.uk/product/acetone-solvent-cleaner/": {
      "name": "ACETONE CLEANER(CL20AC/5)",
      "brand": "Clostermann",
      "price": 26.54,
      "currency": "GBP",
      "description": "Acetone Cleaner.The first step in painting metal is to thoroughly clean it. The metal might look and feel clean, but any grease, oil, dirt, or rust left on there will prevent the paint from properly adhering to the surface. Avoid using water to clean metal; instead, use a solvent such as acetone.It is water miscible, so can be used in conjunction with water. A common cleaning routine is to rinse with water first to wash away inorganic salts and then rinse with acetone to wash away the organic materials which the water cannot dissolve. ... Lastly acetone is quite widely used because it is relatively cheap.Acetone is considered to be a solvent since it can be used for general cleaning or heavy de-greasing jobs. Solvents are compounds capable of dissolving grease, paint, or additional organic substances from the surface of an item",
      "image_url": "https://www.advancedpaints.co.uk/wp-content/uploads/2019/01/Sprintline-5ltr.png",
      "source_url": "https://www.advancedpaints.co.uk/product/acetone-solvent-cleaner/",
      "match_score": 1.0
    }
  },
  "geet chem specialities": {
    "https://www.geetchem.com/acetone-solvent-8359820.html": {
      "name": "Acetone Solvent",
      "price": 80.0,
      "currency": "INR",
      "description": "Product Details: Storage: Room Temperature, Taste: Odorless, Usage: Chemical Industry",
      "source_url": "https://www.geetchem.com/acetone-solvent-8359820.html",
      "match_score": 1.0
    }
  },
  "woodcraft": {
    "https://www.woodcraft.com/products/klean-strip-acetone-solvent-quart": {
      "name": "Acetone - Solvent - Quart",
      "brand": "Klean Strip",
      "price": 14.99,
      "currency": "USD",
      "description": "Klean Strip® Acetone is a strong, fast acting solvent that can be used as a thinner and remover for specified coatings including: polyester and epoxy resins, ink, adhesives and contact cement. Acetone is an effective cleanup solvent after the completion of a fiberglass project, for removal of excess fiberglass resin or foreign material from solvent-tolerant surfaces. Use only as specified by the coating or adhesive manufacturer.Features: 100% pure Strong, fast drying solvent An effective cleanup solvent after completing a fiberglass project Removes excess fiberglass Apply to small areas Specifications: Size: Quart Properties: Clear, colorless liquid with a characteristic ketone odor.  Odor may be described as a sweet pungent odor. Recommended Use: Paint, stain and varnish thinning What's Included: (1) Klean Strip Acetone - Solvent - Quart",
      "image_url": "https://www.woodcraft.com/cdn/shop/files/85O51_000_001_2500x.jpg?v=1720483478",
      "source_url": "https://www.woodcraft.com/products/klean-strip-acetone-solvent-quart",
      "match_score": 0.8,
      "Size": "Quart",
      "Properties": "Clear, colorless liquid with a characteristic ketone odor. Odor may be described as a sweet pungent odor.",
      "Recommended Use": "Paint, stain and varnish thinning"
    }
  },
  "lawsons": {
    "https://www.lawsons.co.uk/cure-it-1ltr-acetone-solvent-cleaner-h00001492": {
      "name": "Cure It 1ltr Acetone Solvent Cleaner",
      "brand": "Cure It",
      "price": 6.59,
      "currency": "GBP",
      "description": "Cure It 1L Acetone solvent cleaner. Used for cleaning tools, spillages and as a surface decontaminant.",
      "image_url": "https://www.lawsons.co.uk/media/catalog/product/c/u/cure_20it_201ltr_20acetone_20solvent_20cleaner-9934-extra-large.jpg?optimize=medium&bg-color=255,255,255&fit=bounds&height=&width=&canvas=:",
      "source_url": "https://www.lawsons.co.uk/cure-it-1ltr-acetone-solvent-cleaner-h00001492",
      "match_score": 1.0,
      "Volume": "1 Litre"
    }
  },
  "chemical superstore": {
    "https://chemicalsuperstore.co.uk/shop/industrokhem/liquids/1l-20l-acetone-pure-acetone-acrylic-nail-remover-nail-polish-remover-99-8/": {
      "name": "Acetone (99.8%)",
      "price": 9.99,
      "currency": "GBP",
      "description": "Mainly used as a solvent, household uses include being the active ingredient in nail polish remover and as paint thinner. Our 99.8% acetone is quality anhydrous and has a wide range of uses. Acetone is colourless, volatile, flammable liquid and is the simplest and smallest ketone. Acetone is miscible with water and serves as an incredibly important solvent in it’s own right. Acetone is typically used for cleaning laboratories. Acetone is a common building block in organic chemistry. Familiar household uses of acetone are as the active ingredient in nail polish remover and as paint thinner. Solvent: Acetone is an extremely good solvent which is used for many plastics and other synthetic fibres. It is used for thinning polyester resin, cleaning tools with and dissolving part epoxies and superglue before they harden. In this respect it is fantastic for model makers, sculptures and anything involving small plastic kits. As a heavy-duty degreaser, it is useful in the preparation of metal prior to painting. It is also useful for high reliability soldering applications to remove rosin flux after soldering is complete; this helps to prevent the rusty bolt effect. Acetone is used as a solvent by the pharmaceutical industry and as a denaturant in the denatured alcohol. Acetone is also present as an excipient in some pharmaceutical drugs. Acetone can also be used to dissolve acetylene. Used as a solvent to dissolve: Paints – Varnishes – Lacquers – Fats – Oils – Waxes – Resins – Printing inks – Plastics – Glues. Used to make various other products: Plastics – Fibers – Drugs – Rayon – Photographic Film – Smokeless powder – Other chemicals Laboratory: In the laboratory, acetone is used as a polar, aprotic solvent in a variety of organic reactions, such has sn2 reactions. The use of acetone solvent is critical for the Jones oxidation. It does not form an azeotrope with water. It is a common solvent for rinsing laboratory glassware because of its lower cost and volatility . Despite its common use as a supposed drying agent, it is not effective except by bulk displacement and dilution. Acetone is fluorescent under ultraviolet light and it vapour can be used as fluorescent tracer in fluid flow experiments. Acetone is used to precipitate proteins. Medical & Cosmetic: Acetone is used in a variety of general medical and cosmetic applications and is also listed as a competent in food additives and food packaging and also in nail polish remover. Many of the salons who buy our acetone as nail polish remover have rated it 5 star for quality and buy regularly. Dermatologists use acetone with alcohol for acne treatments to peel dry skin. Acetone is regularly used in chemical peeling and for toe care. Domestic and Niche Uses: Acetone is the primary competent in cleaning agents such as nail polish remover. This means it is used in bulk by nail salons. Acetone is a key component of superglue remover and easily removes residues from glass and porcelain. Make-up artists make extensive use of acetone to remove skin adhesive from the netting of wigs and moustaches by immersing the item in an acetone bath, then removing the softened glue residue with a stiff brush. Acetone’s ability to loosen hardened glues makes it ideal for arts and crafts. Acetone is often used for vapour polishing of printed artifacts on 3D-printed models printed with ABS plastic. The technique, called acetone vapour bath smoothing, involves placing the printed part in a sealed chamber containing a small amount of acetone and heating to around 80 degrees Celsius for 10 minutes. This creates a vapor of acetone in the container. The acetone condenses even all over the part, causing the surface to soften and liquefy. Surface tension then smooths the semi-liquid plastic. When the part if removed from the chamber, the acetone component evaporates leaving a glassy smooth part free of striation, patterning and visible edges, common features in untreated 3D printed parts. Common Product Uses: Nail Polish Remover Paint Thinner Laboratory Uses Oil Stain Remover Gum Remover Wig Remover Fuel Additive Solvent Paper-mache Art & Crafts ACETONE SAFETY INFORMATION Highly flammable liquid and vapour. Causes serious eye irritation. May cause drowsiness or dizziness Keep away from heat/sparks/open flames/hot surface. – No smoking. IF INHALED: Remove victim to fresh air and keep at rest in a position comfortable for breathing. IF IN EYES: Rinse cautiously with water for several minutes. Remove contact lenses, if present and easy to do. Continue rinsing. Avoid breathing dust/fume/gas/mist/vapours/spray, Wear protective gloves/protective clothing/eye protection/face protection. Get medical advice/attention if you feel unwell. H225: HIGHLY FLAMMABLE H319: CAUSES SERIOUS EYE IRRITATION H336: MAY CAUSE DROWSINESS OR DIZZINESS",
      "source_url": "https://chemicalsuperstore.co.uk/shop/industrokhem/liquids/1l-20l-acetone-pure-acetone-acrylic-nail-remover-nail-polish-remover-99-8/",
      "Purity": "99.8%",
      "State": "liquid"
    }
  },
  "suraj enterprises": {
    "https://www.suraj-enterprises.in/acetone-solvent.html": {
      "name": "Acetone Solvent",
      "brand": "Suraj Enterprises",
      "price": 75.0,
      "currency": "INR",
      "description": "Acetone SolventWholesale Supplier of a wide range of products which include acetone solvent.Acetone, a colorless, volatile liquid with a characteristic sweet odor, is one of the simplest and most widely used organic solvents. It is a key component in many industries, including pharmaceuticals, cosmetics, paints, coatings, adhesives, and cleaning products. Its remarkable solvent properties enable it to dissolve a wide range of organic compounds, making it invaluable in various applications.One of acetone's primary uses is as a solvent for cleaning surfaces and removing residues, particularly in nail polish removers and paint thinners. Its fast evaporation rate facilitates quick drying without leaving behind any residue. Additionally, acetone is employed as a solvent in the production of numerous chemicals and pharmaceuticals, as well as in laboratory settings for chromatography and extraction processes.While acetone is highly effective as a solvent, it is important to handle it with care due to its flammable nature. Adequate ventilation and precautions against skin and eye contact are necessary to minimize risks. However, when used responsibly, acetone proves to be a versatile and indispensable solvent in various industrial and household applications.",
      "source_url": "https://www.suraj-enterprises.in/acetone-solvent.html",
      "match_score": 1.0,
      "Purity": "99.90%",
      "Grade Standard": "Industrial Grade",
      "Physical State": "Liquid",
      "Packaging Details": "160 kg Drum",
      "Packaging Type": "Drum",
      "Country of Origin": "Made in India"
    }
  },
  "cleaningsupplies.co.uk": {
    "https://www.cleaningsupplies.co.uk/products/craftex-acetone-solvent-glue-remover--each": {
      "name": "CRAFTEX ACETONE SOLVENT GLUE REMOVER",
      "brand": "CRAFTEX",
      "price": 12.1,
      "currency": "GBP",
      "description": "An effective solvent for the removal of glue, nail polish, varnish and general spots etc. from carpets, upholstery and fabrics. Very strong and wear gloves when handling. Use with care. This is professional trade stuff and PPE should always be worn when handling. For more information please check the link here :-ACETONE PRODUCT SPECIFICATION SHEET For SDS information please check the link here :-ACETONE SAFETY DATA SHEET DIRECTIONS Ready to use. Apply with a clean white cloth in a well ventilated area. Safe to use on most fabrics. Do not use on suede. Repeat process as required. Do not allow to penetrate rubber or bitumen backings on carpets",
      "source_url": "https://www.cleaningsupplies.co.uk/products/craftex-acetone-solvent-glue-remover--each",
      "match_score": 1.0
    }
  },
  "mistral industrial chemicals": {
    "https://mistralni.co.uk/products/acetone": {
      "name": "Acetone 99.5% (2-propanone)",
      "brand": "Mistral",
      "price": 18.99,
      "currency": "GBP",
      "description": "Acetone is a clear, colourless, low-boiling, flammable and volatile liquid characterized by rapid evaporation and a faintly aromatic odour. It readily mixes with most organic solvents and mixes completely with water. However, compatibility should be checked prior to mixing with other solvents or materials. PROPERTIES OF ACETONE: Synonyms: B-ketopropane, dimethyl ketone, dimethylformaldehyde, DMK, propanone, 2-propanone, propan-2-one CAS NO: 67-64-1 Appearance: clear liquid Colour: <5 pt-co=\"\" li=\"\"> Distillation BP: 56.2oC Melting point: -94.9oC Flash Point: -20oC Autoignition temperature: 465oC Assay: 99.5 % Min Water: 0.1% max Non volatile residue: 20 ppm max Acidity as acetic acid: 20 ppm max Permanganate fading time: 90 minutes min Applications for Acetone: Nail varnish remover Nail extension remover Laboratory reagent Paint remover formulations Solvent Cleaner & Degreaser Acetone is used as a denaturation agent in denatured alcohol. In the laboratory, acetone is used as a solvent in a variety of organic reactions , such as SN2 reactions. The use of acetone solvent is also critical for the Jones oxidation. It is a common solvent for rinsing laboratory glassware because of its low cost, volatility, and ability to dissolve water. For similar reasons, acetone is also used as a drying agent. Acetone can be cooled with dry ice to -78 oC without freezing; acetone/dry ice baths are commonly used to conduct reactions at low temperatures. Acetone is fluorescent under ultraviolet light, and acetone vapor may be used as a fluorescent tracer in fluid flow experiments. Acetone is often the primary component in cleaning agents such as nail polish remover. Acetone is a component of superglue remover and it easily removes residues from glass and porcelain. Acetone is a good solvent that is a component of some paints and varnishes, as well as for most plastics and synthetic fibres. It is ideal for thinning fiberglass resin, cleaning fiberglass tools and dissolving two-part epoxies and superglue before hardening. A heavy-duty degreaser, it is useful in the preparation of metal prior to painting; it also thins polyester resins, vinyl and adhesives. Acetone can also dissolve many plastics, including those used in Nalgene bottles made of polystyrene, polycarbonate and some types of polypropylene. Many millions of kilograms of acetone are consumed in the production of the solvents methyl isobutyl alcohol and methyl isobutyl ketone. These products arise to give diacetone alcohol. 2 (CH3)2CO(CH3) 2C(OH)CH2C(O)CH3 It can be used as an artistic agent; when rubbed on the back of a laser print or photocopy placed face-down on another surface and burnished firmly, the toner of the image is allowed to transfer to the destination surface. Some automotive enthusiasts add acetone at around 1 part in 500 to their fuel, following claims of dramatic improvement in fuel economy and engine life. This practice is controversial as the body of systematic testing shows that acetone has no measurable effect or may in fact reduce engine life by adversely affecting fuel system parts. Health & Safety: F; R11; Xi; R36; R66; R67 EUH066: Repeated exposure may cause skin dryness or cracking. H225: Highly Flammable liquid and vapour. H319: Causes serious eye irritation. H336: May cause drowsiness or dizziness. PLEASE NOTE: This product is not for human or animal consumption.",
      "image_url": "https://mistralni.co.uk/cdn/shop/products/acetone_1L_2669x.jpg?v=1551221199",
      "source_url": "https://mistralni.co.uk/products/acetone",
      "match_score": 1.0,
      "Assay": "99.5 % Min",
      "Water": "0.1% max",
      "Non volatile residue": "20 ppm max",
      "Acidity as acetic acid": "20 ppm max",
      "Permanganate fading time": "90 minutes min",
      "Appearance": "clear liquid",
      "Distillation BP": "56.2oC",
      "Melting point": "-94.9oC",
      "Flash Point": "-20oC",
      "Autoignition temperature": "465oC",
      "CAS NO": "67-64-1"
    }
  },
  "greenwell biotech": {
    "https://www.greenwellbiotech.co.in/acetone-solvent-6948010.html": {
      "name": "Acetone Solvent",
      "price": 65.0,
      "currency": "INR",
      "description": "Acetone Solvent is a good solvent for many plastics and some synthetic fibers. It is used as one of the volatile components of some paints and varnishes. Our offered chemical is formulated by using supreme grade material under the guidance of high skilled professionals. This product is available in various packaging options as per the requirements of our clients. In addition to this, the offered Acetone Solvent is packed with high precision to ensure its purity for a longer period. Product Details: Boiling Point 56 Degree Celsius, Form Liquid, Grade Standard Industrial Grade, CAS Number 67-64-1, Chemical Formula C3H6O, Synonyms Dimethyl Ketone, Dimethyl Carbonyl, Ketone Propane, 2-propanone, beta-ketopropane, Molecular Weight 58.08 g/mol, Solubility in water Miscible, Vapor pressure 30.6 kPa (25 DegreeC), Color Colourless, Odour pungent and floral (mint-like), Acidity 19.16 pKa (H2O), Refractive index 1.3588, Viscosity 0.295 mPas, Flash Point -20 DegreeC, Ignition Temperature 465 DegreeC, Freezing Point -95 DegreeC, Surface tension 25.2 mN/m, Thermal Conductivity 0.0115 W/m-K, Hazards Highly flammable, causes eye irritation and dizziness, Precautions Keep away from sparks/open flames/hot surfaces. Store in ventilated place., Shelf life 2 to 5 years, HS Code 29141100, EC No. 200-662-2, Molecular Formula C3H6O, Melting Point 95 Degree Celsius, Density 784 kg/m Cube, Classification Ketone",
      "source_url": "https://www.greenwellbiotech.co.in/acetone-solvent-6948010.html",
      "match_score": 1.0,
      "CAS No": "67-64-1",
      "Physical State": "Liquid",
      "Shelf Life": "2-5 Years",
      "Purity(%)": "99%",
      "Boiling Point": "56 Degree Celsius",
      "Grade Standard": "Industrial Grade",
      "Chemical Formula": "C3H6O",
      "Molecular Weight": "58.08 g/mol",
      "Solubility in water": "Miscible",
      "Vapor pressure": "30.6 kPa (25 DegreeC)",
      "Color": "Colourless",
      "Odour": "pungent and floral (mint-like)",
      "Acidity": "19.16 pKa (H2O)",
      "Refractive index": "1.3588",
      "Viscosity": "0.295 mPas",
      "Flash Point": "-20 DegreeC",
      "Ignition Temperature": "465 DegreeC",
      "Freezing Point": "-95 DegreeC",
      "Surface tension": "25.2 mN/m",
      "Thermal Conductivity": "0.0115 W/m-K",
      "HS Code": "29141100",
      "EC No.": "200-662-2",
      "Melting Point": "95 Degree Celsius",
      "Density": "784 kg/m Cube"
    }
  },
  "multi chem": {
    "https://www.multichem104.com/acetone-solvent-8307176.html": {
      "name": "Acetone Solvent",
      "price": 85.0,
      "currency": "INR",
      "description": "Acetone solvents witness profound applications in a wide range of industrial uses, and hence they are often in high demand amongst industries. Your business can also serve to such a high demand thanks to the prolific supply of Acetone solvent from Multi Chem. Our Acetone solvent at Multi Chem could be the best possible companion for all your industrial applications, such as its use as a solvent for manufacturing plastics and as an agent for thinning polyester resin. Further, it can also be used as a volatile component in paints and varnishes. With such uses, the inclusion of such a product into your product line could be your way to growth.",
      "source_url": "https://www.multichem104.com/acetone-solvent-8307176.html",
      "match_score": 0.8,
      "Application": "Commercial",
      "Physical State": "Liquid",
      "Purity(%)": "99%"
    }
  },
  "marine industrial": {
    "https://www.marineindustrial.co.uk/solvents/marine-industrial/acetone-solvent-no4-1l": {
      "name": "ACETONE SOLVENT NO.4 1L",
      "brand": "M&I Acetone",
      "price": 7.25,
      "currency": "GBP",
      "description": "Pure acetone for cleaning and degreasing surfaces. Can also be used to clean metal tools.",
      "image_url": "https://www.marineindustrial.co.uk/images/uploaded/Acetone.jpg",
      "source_url": "https://www.marineindustrial.co.uk/solvents/marine-industrial/acetone-solvent-no4-1l",
      "match_score": 0.9,
      "Volume": "1L"
    }
  },
  "arima chemicals & systems": {
    "https://www.arimachemicals.com/acetone-solvent-chemical-9921372.html": {
      "name": "Acetone Solvent Chemical",
      "brand": "Arima Chemicals & Systems",
      "price": 89.0,
      "currency": "INR",
      "description": "Acetone Solvent Chemical is a high-quality industrial grade chemical with a molecular formula of C3H6O and CAS No of 67-64-1. This liquid chemical has a purity of greater than 99% and is highly soluble in liquids. It is commonly used as a nail polish remover and has a shelf life of 24 months when stored at room temperature. This chemical is perfect for industrial applications due to its high purity and solubility. It is widely used in the production of plastics, fibers, and other synthetic materials. Acetone solvent chemical is also used in the manufacturing of pharmaceuticals, paints, and adhesives.",
      "source_url": "https://www.arimachemicals.com/acetone-solvent-chemical-9921372.html",
      "match_score": 0.9,
      "Molecular Formula": "C3H6O",
      "CAS No": "67-64-1",
      "Purity": "> 99%",
      "Shelf life": "24 months",
      "Physical Form": "Liquid",
      "Grade": "Industrial Grade",
      "Usage": "Nail Polish Remover",
      "Molecular Weight": "58.08 g/mol",
      "Density": "0.784 - 0.786",
      "Solubility in water": "Yes",
      "Acidity": "0.002 max",
      "HS Code": "291411",
      "Color": "Colourless",
      "Odour": "Sweet"
    }
  }
}