{
  "saniclean": {
    "https://www.ebay.at/itm/184004463325": {
      "name": "Pure Acetone 99.8% Pure Multi Listing Pure Chem (White)",
      "brand": "Saniclean",
      "price": 8.89,
      "currency": "EUR",
      "description": "Pure Acetone 99.8% Pure Multi Listing Pure Chem (White). New, unused and undamaged item in unopened original packaging (where packaging is applicable). The packaging should be the same as what is found in a retail environment, unless the item was packaged by the manufacturer in non-retail packaging, such as an unprinted box or plastic bag. See the seller's listing for full details.",
      "image_url": [
        "https://i.ebayimg.com/images/g/RNgAAOSwhl9g5F5d/s-l1600.jpg",
        "https://i.ebayimg.com/images/g/61MAAOSwPzdg5FoX/s-l1600.png",
        "https://i.ebayimg.com/images/g/mvwAAOSwh1Vg5F5k/s-l1600.jpg",
        "https://i.ebayimg.com/images/g/pOAAAOSwTExg5Fog/s-l1600.png",
        "https://i.ebayimg.com/images/g/PlYAAOSwK~Ng5F5Z/s-l1600.jpg"
      ],
      "source_url": "https://www.ebay.at/itm/184004463325",
      "match_score": 0.8,
      "Purity": "99.8%",
      "Color": "White",
      "MPN": "SCEBACETONE",
      "Country/Region of Manufacture": "United Kingdom"
    }
  },
  "easy composites": {
    "https://www.easycomposites.eu/pure-acetone": {
      "name": "Acetone",
      "brand": "Easy Composites",
      "price": 3.5,
      "currency": "EUR",
      "description": "Acetone is a high strength solvent widely used in the composites industry for cleaning resin from brushes, rollers and equipment. Acetone will effectively dissolve and clean epoxy, polyester and vinylester resin. It can also be used as a high strength de-greaser/surface preparation and paint remover. Safety Information Acetone is a powerful and highly flammable solvent. Please observe the health and safety data.",
      "source_url": "https://www.easycomposites.eu/pure-acetone",
      "match_score": 0.8,
      "Purity": "100%"
    }
  },
  "woodcraft": {
    "https://www.woodcraft.com/products/klean-strip-acetone-solvent-quart": {
      "name": "Acetone - Solvent - Quart",
      "brand": "Klean Strip",
      "price": 14.99,
      "currency": "USD",
      "description": "Klean Strip® Acetone is a strong, fast acting solvent that can be used as a thinner and remover for specified coatings including: polyester and epoxy resins, ink, adhesives and contact cement. Acetone is an effective cleanup solvent after the completion of a fiberglass project, for removal of excess fiberglass resin or foreign material from solvent-tolerant surfaces. Use only as specified by the coating or adhesive manufacturer.Features: 100% pure Strong, fast drying solvent An effective cleanup solvent after completing a fiberglass project Removes excess fiberglass Apply to small areas Specifications: Size: Quart Properties: Clear, colorless liquid with a characteristic ketone odor.  Odor may be described as a sweet pungent odor. Recommended Use: Paint, stain and varnish thinning What's Included: (1) Klean Strip Acetone - Solvent - Quart",
      "image_url": "https://www.woodcraft.com/cdn/shop/files/85O51_000_001_2500x.jpg?v=1720483478",
      "source_url": "https://www.woodcraft.com/products/klean-strip-acetone-solvent-quart",
      "match_score": 0.8,
      "Size": "Quart",
      "Properties": "Clear, colorless liquid with a characteristic ketone odor. Odor may be described as a sweet pungent odor.",
      "Recommended Use": "Paint, stain and varnish thinning"
    }
  },
  "suraj enterprises": {
    "https://www.suraj-enterprises.in/acetone-solvent.html": {
      "name": "Acetone Solvent",
      "brand": "Suraj Enterprises",
      "price": 75.0,
      "currency": "INR",
      "description": "Acetone SolventWholesale Supplier of a wide range of products which include acetone solvent.Acetone, a colorless, volatile liquid with a characteristic sweet odor, is one of the simplest and most widely used organic solvents. It is a key component in many industries, including pharmaceuticals, cosmetics, paints, coatings, adhesives, and cleaning products. Its remarkable solvent properties enable it to dissolve a wide range of organic compounds, making it invaluable in various applications.One of acetone's primary uses is as a solvent for cleaning surfaces and removing residues, particularly in nail polish removers and paint thinners. Its fast evaporation rate facilitates quick drying without leaving behind any residue. Additionally, acetone is employed as a solvent in the production of numerous chemicals and pharmaceuticals, as well as in laboratory settings for chromatography and extraction processes.While acetone is highly effective as a solvent, it is important to handle it with care due to its flammable nature. Adequate ventilation and precautions against skin and eye contact are necessary to minimize risks. However, when used responsibly, acetone proves to be a versatile and indispensable solvent in various industrial and household applications.",
      "source_url": "https://www.suraj-enterprises.in/acetone-solvent.html",
      "match_score": 0.9,
      "Purity": "99.90%",
      "Grade Standard": "Industrial Grade",
      "Physical State": "Liquid",
      "Packaging Details": "160 kg Drum",
      "Packaging Type": "Drum",
      "Country of Origin": "Made in India"
    }
  },
  "multi chem": {
    "https://www.multichem104.com/acetone-solvent-8307176.html": {
      "name": "Acetone Solvent",
      "brand": "Multi Chem",
      "price": 85.0,
      "currency": "INR",
      "description": "Acetone solvents witness profound applications in a wide range of industrial uses, and hence they are often in high demand amongst industries. Your business can also serve to such a high demand thanks to the prolific supply of Acetone solvent from Multi Chem. Our Acetone solvent at Multi Chem could be the best possible companion for all your industrial applications, such as its use as a solvent for manufacturing plastics and as an agent for thinning polyester resin. Further, it can also be used as a volatile component in paints and varnishes. With such uses, the inclusion of such a product into your product line could be your way to growth.",
      "source_url": "https://www.multichem104.com/acetone-solvent-8307176.html",
      "match_score": 0.8,
      "Application": "Commercial",
      "Physical State": "Liquid",
      "Purity(%)": "99%"
    }
  },
  "arima chemicals & systems": {
    "https://www.arimachemicals.com/acetone-solvent-chemical-9921372.html": {
      "name": "Acetone Solvent Chemical",
      "brand": "Arima Chemicals & Systems",
      "price": 89.0,
      "currency": "INR",
      "description": "Acetone Solvent Chemical is a high-quality industrial grade chemical with a molecular formula of C3H6O and CAS No of 67-64-1. This liquid chemical has a purity of greater than 99% and is highly soluble in liquids. It is commonly used as a nail polish remover and has a shelf life of 24 months when stored at room temperature. This chemical is perfect for industrial applications due to its high purity and solubility. It is widely used in the production of plastics, fibers, and other synthetic materials. Acetone solvent chemical is also used in the manufacturing of pharmaceuticals, paints, and adhesives.",
      "source_url": "https://www.arimachemicals.com/acetone-solvent-chemical-9921372.html",
      "match_score": 0.8,
      "Purity": "> 99%",
      "Molecular Formula": "C3H6O",
      "CAS No": "67-64-1",
      "Physical Form": "Liquid",
      "Color": "Colourless",
      "Odour": "Sweet",
      "Shelf life": "24 months",
      "Molecular Weight": "58.08 g/mol",
      "Density": "0.784 - 0.786",
      "Solubility in water": "Yes",
      "Acidity": "0.002 max",
      "Grade": "Industrial Grade",
      "Packaging Details": "160 kg Drum",
      "Usage/Application": "Nail Polish Remover"
    }
  }
}