{
  "medcare4u": {
    "https://medcare4u.hr/de/orphi-isopropanol-alkohol-70-1-liter-p178021-8711407177722": {
      "name": "Orphi Isopropanol Alkohol 70 % 1 Liter",
      "brand": "Orphi Farma",
      "price": 10.83,
      "currency": "EUR",
      "description": "Orphi Isopropanol Alcohol 70 % ist ein vielseitiger Reinigungsalkohol, der sich perfekt für die tägliche Reinigung und Desinfektion eignet. Dieser Isopropylalkohol hat eine ideale Konzentration zur Desinfektion von Oberflächen, Händen und Instrumenten und wird häufig sowohl im häuslichen als auch im professionellen Bereich verwendet. Dank seiner Konzentration von 70 % bietet dieser Reinigungsalkohol ein wirksames Gleichgewicht zwischen Desinfektion und schneller Verdunstung. Es verdunstet schnell und eignet sich daher ideal zum Reinigen von elektronischen Geräten, Glas und anderen Oberflächen, ohne Streifen oder Rückstände zu hinterlassen. Darüber hinaus baut es Fette effektiv ab und eignet sich daher hervorragend zum Entfernen von Schmutz und Flecken. Orphi Isopropanol Alcohol 70 % ist eine zuverlässige Wahl für alle, die ein Produkt suchen, das sowohl gründlich reinigt als auch Bakterien und andere Mikroorganismen effektiv entfernt. Dieser Reinigungsalkohol ist ein Muss für ein breites Anwendungsspektrum, von der Haushaltsreinigung bis zur Industriereinigung. Ob Sie Werkzeuge desinfizieren oder empfindliche Oberflächen reinigen möchten, dieser Isopropylalkohol bietet die Kraft und Flexibilität, die Sie für eine saubere und sichere Umgebung benötigen. Was sind die Inhaltsstoffe von Orphi Isopropanol Alkohol 70 % 1 Liter? Isopropanol, Aqua Produktspezifikationen Orphi Isopropanol Alkohol 70 % 1 Liter Hersteller: Orphi Pharma Typ: Reinigungsmittel Inhalt: 1000 ml Alkoholgehalt: 70 % Farbe: Transparent",
      "image_url": "https://medcare4u.hr/182601-home_default/orphi-isopropanol-alkohol-70-1-liter.jpg",
      "source_url": "https://medcare4u.hr/de/orphi-isopropanol-alkohol-70-1-liter-p178021-8711407177722",
      "match_score": 0.6,
      "Inhalt": "1000 ml",
      "Alkoholgehalt": "70 %",
      "Farbe": "Transparent"
    }
  },
  "east coast fibreglass supplies": {
    "https://www.fibreglassroofingsupplies.co.uk/isopropanol-alcohol": {
      "name": "Isopropanol Alcohol",
      "brand": "East Coast Fibreglass Supplies",
      "price": 6.95,
      "currency": "GBP",
      "description": "99.9% purity. Ideal for cleaning PCB's, optical equipment and other electronic parts and components. Leaves a grease free surface with no residue.",
      "source_url": "https://www.fibreglassroofingsupplies.co.uk/isopropanol-alcohol",
      "match_score": 0.9,
      "Purity": "99.9%"
    }
  },
  "colorway": {
    "https://colorway.com/en_EU/cleaner/product/CW-3360": {
      "name": "Cleanier Alcohol Aerosol ColorWay for disinfection",
      "brand": "ColorWay",
      "price": 3.79,
      "currency": "EUR",
      "description": "99% denatured alcohol spray. An excellent universal tool for cleaning various surfaces. The unique advantage of such alcohol compared to household chemicals is the absence of dangerous components that can cause irritation and allergies. It copes with cleaning metal, ceramics, electronic boards, contacts, external plastic parts of a PC, fax, printer and various surfaces resistant to alcohol. Does not lubricate, does not contain oil or grease. Warning: H222 Extremely flammable aerosol. H229 Pressurised container: May burst if heated. H319 Causes serious eye irritation. H332 Harmful if inhaled. H335 May cause respiratory irritation. H336 May cause drowsiness or dizziness. P102 Keep out of reach of children. P210 Keep away from heat/sparks/open flames/hot surfaces. — No smoking. P211 Take any precaution to avoid mixing with combustibles. P303+ P361+P353 IF ON SKIN (or hair): Take off immediately all contaminated clothing. Rinse skin with water/shower. P304+P340+P312 IN CASE OF INHALE: Remove person to fresh air and keep comfortable for breathing. Call a POISON CENTER/ doctor if you feel unwell. P305+P351+P338 IF IN EYES: Rinse cautiously with water for several minutes. Remove contact lenses, if present and easy to do. Continue rinsing. P410 + P 412 Protect from sunlight. Do not expose to temperatures exceeding 50 oC/122 oF. P251 Pressurized container: Do not pierce or burn, even after use. P261 Avoid breathing dust/ fume/gas/ mist/vapours/spray. P271 Use only outdoors or in a well-ventilated area. P501 Dispose of contents/container as hazardous waste.",
      "source_url": "https://colorway.com/en_EU/cleaner/product/CW-3360",
      "match_score": 0.9,
      "Volume": "500 ml",
      "Alcohol Percentage": "99.7%",
      "Other Components": "Propane/butane/isobutane"
    }
  },
  "hebei jinchangsheng chemical technology co., ltd.": {
    "https://hncyhg.en.made-in-china.com/product/ltwUPbZWSqVO/China-Factory-Price-CAS-67-63-0-200kg-Drum-Ipa-Isopropyl-Alcohol-Isopropanol-99-9-.html": {
      "name": "Factory Price CAS 67-63-0 200kg/Drum Ipa Isopropyl Alcohol Isopropanol 99.9%",
      "brand": "Hebei Jinchangsheng Chemical Technology Co., Ltd.",
      "price": 2000.0,
      "currency": "USD",
      "description": "Factory Price CAS 67-63-0 200kg/Drum Ipa Isopropyl Alcohol Isopropanol 99.9%, Find Details and Price about Isopropanol Alcohol Isopropanol from Factory Price CAS 67-63-0 200kg/Drum Ipa Isopropyl Alcohol Isopropanol 99.9% - Hebei Jinchangsheng Chemical Technology Co., Ltd. Isopropyl alcohol, also known as isopropanol or IPA, is a colorless, flammable chemical compound with the formula C3H8O. It is a common solvent used in various industrial and household applications.  This particular product is offered in 200kg drums and has a purity of 99.9%.",
      "image_url": "https://image.made-in-china.com/2f0j00mfyBFANRGqoU/Factory-Price-CAS-67-63-0-200kg-Drum-Ipa-Isopropyl-Alcohol-Isopropanol-99-9-.webp",
      "source_url": "https://hncyhg.en.made-in-china.com/product/ltwUPbZWSqVO/China-Factory-Price-CAS-67-63-0-200kg-Drum-Ipa-Isopropyl-Alcohol-Isopropanol-99-9-.html",
      "match_score": 0.9,
      "CAS No.": "67-63-0",
      "Formula": "C3H8O",
      "EINECS": "200-661-7",
      "Classification": "Aromatic Alcohol",
      "Appearance": "Liquid",
      "Type": "1°(Primary Alcohol)",
      "Purity": "99.9%",
      "Packaging": "200kg/Drum"
    }
  },
  "trade chemicals ltd": {
    "https://trade-chem.co.uk/liquids/isopropanol-alcohol-ipa-99-99-tech-grade/": {
      "name": "Isopropanol Alcohol IPA 99.99% (Tech Grade)",
      "brand": "Pure Chem",
      "price": 6.99,
      "currency": "GBP",
      "description": "Isopropanol Alcohol IPA 99.99% Tech GradeIsopropanol Alcohol 99.99% also known as IPA, is a colourless, flammable liquid with a strong odour that evaporates quickly. It dissolves a wide range of non-polar compounds and leaves nearly zero oil traces. Compared to alternative solvents isopropanol alcohol is relatively non-toxic,  as a result it is used widely as a cleaning fluid, disinfectant, Fuel Additive, solvent and for its Pharmaceutical and Medical Applications.Isopropanol alcohol’s ability to dissolve oils lead it to being used to clean a wide range of electronic devices such as contact pins, magnetic tape and disk heads (such as Audio and video tape recorders and floppy disk drives), the lenses of lasers in optical disc drives (e.g., CD, DVD) and removing thermal paste from heatsinks and IC packages (such as CPUs).IPA is also used in the making ofRubbing alcohol,hand sanitizer, and disinfecting pads that typically contain a 30–70% solution of isopropyl alcohol depending on the exact use.",
      "source_url": "https://trade-chem.co.uk/liquids/isopropanol-alcohol-ipa-99-99-tech-grade/",
      "match_score": 0.9,
      "Chemical Name": "Isopropanol",
      "Chemical Formula": "C3H8O",
      "Common Names": "Isopropyl Alcohol, IPA, 2-propanol",
      "Purity/Concentration": "99.99%",
      "Grade/Type": "Technical grade",
      "Appearance": "Liquid form",
      "Odour": "Alcohol odour",
      "Solubility": "Soluble in water and many organic solvents",
      "Boiling Point": "Approximately 82-83°C (179-181°F)",
      "Flash Point": "Varies with the concentration, typically around 12-24°C (54-75°F)",
      "Density": "Varies with concentration, typically around 0.785 g/cm3"
    }
  },
  "nowchem": {
    "https://shop.nowchem.com.au/shop/food-service/sanitisers/isopropanol-alcohol/": {
      "name": "Isopropanol Alcohol",
      "brand": "Nowchem",
      "price": 56.7,
      "currency": "AUD",
      "description": "This product is a neutral sanitiser which is ideal on hard surfaces and equipment. It may be used as a mild cleaner and disinfectant in food processing, hospitals and other areas that require rinse-free sanitation.",
      "image_url": "https://nowchem.com.au/wp-content/uploads/2018/02/Isopropyl-Alcohol.png",
      "source_url": "https://shop.nowchem.com.au/shop/food-service/sanitisers/isopropanol-alcohol/",
      "match_score": 0.8,
      "Pack Size": "5L, 20L"
    }
  },
  "octopus®": {
    "https://www.octopus-office.de/shop/en/creative-inks/alcohol-ink/alcohol-ink-sets/9388/octopus-fluids-alcohol-ink-complete-kit-circle-with-blending-solution-alcohol-ink-paper-and-supplies-for-fluid-art-5-x-30-ml": {
      "name": "Octopus Fluids Alcohol Ink Complete Kit CIRCLE",
      "brand": "Octopus®",
      "price": 59.95,
      "currency": "EUR",
      "description": "Alcohol Ink Starter Set in BLOODY MARY, SUNLIGHT, SAPPHIRE, LUCKY GREEN and BROWNIE for Fluid Art. The Octpus Fluids Alcohol Ink Starter Set contains everything you need to start painting Alcohol Ink immediately. In addition to 5 matching alcohol ink colours you will find in this set the Octopus Fluids Blending Solution, Isopropanol, Alcohol Ink Paper as well as useful accessories. This set contains: each 30 ml Alcohol Ink BLOODY MARY, SUNLIGHT, SAPPHIRE, LUCKY GREEN and BROWNIE, 100 ml Blending Solution, 500 ml Isopropanol, 1 Lanavanguard Yupo paper pad, 24 cm x 32 cm with 10 sheets of Alcohol Ink Paper, 200g/m², 10 x pipettes, 1 x small measuring cup, 1 x mini funnel, 1 x 30 cm PVC hose (4 mm), 1 x 15 cm PVC hose (4 mm), 1 x 15 cm PVC hose (8 mm), 4 cellulose swabs, 2 gloves. Create gorgeous color gradients, abstract effects, and endlessly surprising shapes with the brillant Octopus Fluids Alcohol Inks.  The Octopus Fluids Alcohol Ink is a transparent and fast-drying colour with an alcohol base developed especially for fluid painting techniques, resin art and epoxy. It can be used on almost all smooth, non-porous materials. It is best suited to synthetic papers (e.g. Yupo Paper), glass, metal, ceramics, porcelain, and stone. After drying, the acid-free Alcohol Inks are smudge- and waterproof, but can be re-liquefied or removed at any time using isopropyl alcohol.  Thanks to its luminous intensity and extremely well-balanced intercolour bleeding, our Alcohol Inks are not only good for imbuing your fluid painting artworks with their particular expressive force. They are also excellently suited to colouring your resin artworks or resin jewellery.",
      "source_url": "https://www.octopus-office.de/shop/en/creative-inks/alcohol-ink/alcohol-ink-sets/9388/octopus-fluids-alcohol-ink-complete-kit-circle-with-blending-solution-alcohol-ink-paper-and-supplies-for-fluid-art-5-x-30-ml",
      "match_score": 0.2,
      "Ink Colors": "BLOODY MARY, SUNLIGHT, SAPPHIRE, LUCKY GREEN, BROWNIE",
      "Ink Volume per Color": "30 ml",
      "Blending Solution": "100 ml",
      "Isopropanol": "500 ml",
      "Paper Size": "24 cm x 32 cm",
      "Paper Weight": "200g/m²",
      "Number of Paper Sheets": "10",
      "Pipettes": "10",
      "Measuring Cup": "150 ml"
    }
  },
  "siliconesandmore.com": {
    "https://www.siliconesandmore.com/en/isopropanol-alcohol-999.html": {
      "name": "Huismerk - SAM Isopropanol / isopropyl alcohol / IPA 99.9%",
      "brand": "Huismerk - SAM",
      "price": 6.5,
      "currency": "EUR",
      "description": "For disinfection of tools and surfaces. Due to the rapid evaporation and good dissolving of fats, this product can be widely used.",
      "image_url": "https://cdn.webshopapp.com/shops/100888/files/340152068/300x250x2/huismerk-sam-isopropanol-isopropyl-alcohol-ipa-999.jpg",
      "source_url": "https://www.siliconesandmore.com/en/isopropanol-alcohol-999.html",
      "match_score": 0.9,
      "Purity": "99.9%"
    }
  },
  "ican london": {
    "https://icanlondon.com/p/pure-isopropyl-alcohol-cleaning-fluid/": {
      "name": "Isopropanol Alcohol Cleaning Fluid",
      "brand": "iCan London",
      "price": 8.0,
      "currency": "GBP",
      "description": "99.9% pure isopropyl alcohol multi purpouse cleaning fluid",
      "source_url": "https://icanlondon.com/p/pure-isopropyl-alcohol-cleaning-fluid/",
      "match_score": 0.9,
      "Purity": "99.9%",
      "Volume": "500ml",
      "Type": "Spray"
    }
  }
}